Repository: devicenull/supermicro_ipmi_firmware
Catalog: SDK/Tools/dos2unix-6.0/po/*.po
Languages: eo

source: can not write to output file
eo: ne povas registri dosieren

source: program error, invalid conversion mode %d
eo: programa eraro, neĝustan ŝanĝmodon %d

source: using code page %d.
eo: uzante kodpaĝon %d.

source: Failed to open temporary output file: %s
eo: malsukcesis malfermi provizoran dosieron registran: %s

source: using %s as temporary file
eo: uzante %s kiel provizora dosiero

source: Failed to change the permissions of temporary output file %s: %s
eo: Malsukcesis ŝanĝi la permesaĵojn de la provizora eldona dosiero %s: %s

source: Failed to change the owner and group of temporary output file %s: %s
eo: Malsukcesis ŝanĝi la proprietulon kaj grupon de la provizora eldona dosiero %s: %s

source: problems resolving symbolic link '%s'
eo: erarojn legante dosieran ĉeneron '%s'

source: output file remains in '%s'
eo: kreatan dosieron restas en '%s'

source: problems renaming '%s' to '%s': %s
eo: problemojn trovitajn renomigi '%s' al '%s': %s

source: which is the target of symbolic link '%s'
eo: kiu estas la atingon de dosiera ĉenero '%s'

source: error: Value of environment variable DOS2UNIX_LOCALEDIR is too long.
eo: eraro: DOS2UNIX_LOCALEDIR tro longiĝis.

source: active code page: %d
eo: nuntempa kodpaĝo: %d

source: invalid %s conversion mode specified
eo: neuzebla %s ŝanĝmodo menciita

source: option '%s' requires an argument
eo: elekto '%s' bezonas elekto-vorton

source: target of file %s not specified in new file mode
eo: ejon de dosiero %s ne menciita en novmodo dosiera

source: Skipping %s, not a regular file.
eo: Pasante %s, dosiero ne tauĝa.

source: Skipping %s, output file %s is a symbolic link.
eo: Evitante %s, atingan dosieron %s jam estas dosiera ĉenero.

source: Skipping symbolic link %s, target is not a regular file.
eo: Evitante dosieran ĉeneron %s, atingon ne estas normala dosiero.

source: Skipping %s, target of symbolic link %s is not a regular file.
eo: Evitante %s, atingon de dosiera ĉenero %s ne estas normala dosiero.

source: Skipping binary file %s
eo: Pasante ne-tekstan dosieron %s

source: code page %d is not supported.
eo: kodpaĝo %d ne estas konvertebla.

source: Skipping UTF-16 file %s, the current locale character encoding is not UTF-8.
eo: Evitante UTF-16 dosieron %s, la nuntempa lingvo-loka litero-enkodiĝo ne egalas UTF-8.

source: Skipping UTF-16 file %s, the size of wchar_t is %d bytes.
eo: Evitante UTF-16 dosieron %s, la mezuro da wchar_t estas %d okopoj.

source: Skipping UTF-16 file %s, an UTF-16 conversion error occurred.
eo: Evitante UTF-16 dosieron %s, eraro de UTF-16 tradukiĝo okazis.

source: converting file %s to file %s in Unix format ...
eo: ŝanĝante dosieron %s al dosiero %s Unix-en ...

source: problems converting file %s to file %s
eo: problemojn trovitajn dum ŝanĝi dosiero %s al dosiero %s

source: Skipping symbolic link %s.
eo: Evitante dosieran ĉeneron %s.

source: converting file %s to Unix format ...
eo: ŝanĝante dosiero %s Unix-en ...

source: problems converting file %s
eo: problemojn dum ŝanĝi dosiero %s

source: converting file %s to file %s in Mac format ...
eo: ŝanĝante dosiero %s al dosiero %s Mac-en ...

source: converting file %s to file %s in DOS format ...
eo: ŝanĝante dosiero %s al dosiero %s DOS-en ...

source: converting file %s to Mac format ...
eo: ŝanĝante dosiero %s Mac-en ...

source: converting file %s to DOS format ...
eo: ŝanĝante dosiero %s DOS-en ...

source: %s %s (%s) Usage: %s [options] [file ...] [-n infile outfile ...] -ascii convert only line breaks (default) -iso conversion between DOS and ISO-8859-1 character set -1252 Use Windows code page 1252 (Western European) -437 Use DOS code page 437 (US) (default) -850 Use DOS code page 850 (Western European) -860 Use DOS code page 860 (Portuguese) -863 Use DOS code page 863 (French Canadian) -865 Use DOS code page 865 (Nordic) -7 Convert 8 bit characters to 7 bit space -c, --convmode conversion mode convmode ascii, 7bit, iso, mac, default to ascii -f, --force force conversion of binary files -h, --help give this help -k, --keepdate keep output file date -L, --license display software license -l, --newline add additional newline -m, --add-bom add UTF-8 Byte Order Mark -n, --newfile write to new file infile original file in new file mode outfile output file in new file mode -o, --oldfile write to old file file ... files to convert in old file mode -q, --quiet quiet mode, suppress all warnings always on in stdio mode -s, --safe skip binary files (default)
eo: %s %s (%s) Uzado: %s [elektojn] [dosiero ...] [-n antaŭaĵo kreaĵo ...] -ascii nur traduku linio-finojn (jam enŝaltita) -iso traduku inter DOS kaj ISO-8859-1 literaro -1252 Uzu Vindozan kodpaĝon 1252 (Okcident-Eŭropa) -437 Uzu DOS kodpaĝon 437 (Usona) (jam enŝaltita) -850 Uzu DOS kodpaĝon 850 (Okcident-Eŭropa) -860 Uzu DOS kodpaĝon 860 (Portugala) -863 Uzu DOS kodpaĝon 863 (Kebekia) -865 Uzu DOS kodpaĝon 865 (Nordlandaj) -7 Traduku de 8-bitaj literoj en blankspacon -c, --convmode modo de ŝanĝo ŝanĝmodo ascii, 7bit, iso, mac, provizore elektita ascii -f, --force forte konvertado de netekstaj dosieroj -h, --help diri ĉi tiun mesaĝon -k, --keepdate konservi dato-tempon dosieran -L, --license eldiru permesilon tekstan -l, --newline aldoni markon linian finan -m, --aldoni-bom aldoni UTF-8 internan ordo-markon -n, --newfile registri novan dosieron antaŭaĵo al antaŭa dosiero metita novmoden kreaĵo al dosiero registrita novmoden -o, --oldfile registri malnovan dosieron dosiero... dosiero(j)n por registri per malnova modo -q, --quiet silente eviti avertojn ĉiam enŝaltata dum stdio modo -s, --safe evitu netekstajn dosierojn (jam ŝaltita)

source: -F, --follow-symlink follow symbolic links and convert the targets -R, --replace-symlink replace symbolic links with converted files (original target files remain unchanged) -S, --skip-symlink keep symbolic links and targets unchanged (default)
eo: -F, --follow-symlink legu dosierajn ĉenerojn kaj konverti la atingojn -R, --replace-symlink anstataŭe registru dosierajn ĉenerojn per konvertotaj dosieroj (ne-ĉeneraj atingaj dosieroj restas neŝanĝitaj) -S, --skip-symlink retenu dosierajn ĉenerojn kaj atingojn neŝanĝataj (jam ŝaltita)

source: -V, --version display version number
eo: -V, --version diri eldono-numeron

source: DOS 16 bit version (WATCOMC).
eo: DOS-16 eldono (WATCOMC).

source: DOS 16 bit version (TURBOC).
eo: DOS-16 eldono (TURBOC).

source: DOS 32 bit version (WATCOMC).
eo: DOS-32 eldono (WATCOMC).

source: DOS 32 bit version (DJGPP).
eo: DOS-32 eldono (DJGPP).

source: MSYS version.
eo: MSYS eldono.

source: Cygwin version.
eo: Cygwin eldono.

source: Windows 64 bit version (MinGW-w64).
eo: Windows-64 eldono (MinGW-w64).

source: Windows 32 bit version (WATCOMC).
eo: Windows-32 eldono (WATCOMC).

source: Windows 32 bit version (MinGW).
eo: Windows-32 eldono (MinGW).

source: OS/2 version.
eo: OS/2 eldono.

source: With Unicode UTF-16 support.
eo: Kun subteno de Unikodo da UTF-16.

source: Without Unicode UTF-16 support.
eo: Sen subteno de Unikodo da UTF-16.

source: With native language support.
eo: Uzante denaskan lingvon sistemon.
